import random

faces = ["微笑", "色", "发呆", "得意", "害羞", "睡",
         "调皮", "呲牙", "酷",  "可爱", "玫瑰", "doge",
         "憨笑", "奋斗", "疑问", "嘘", "鼓掌", "哈欠", "亲亲", "眨眼睛",
         "托腮", "卖萌", "惊喜",  "小纠结", "我最美",  "西瓜", "啤酒", "篮球",
         "乒乓", "咖啡", "饭", "玫瑰",  "爱心", "蛋糕", "闪电",
         "足球", "瓢虫", "月亮", "太阳", "礼物", "拥抱", "强",  "握手",
         "胜利", "爱你",  "OK", "爱情",  "跳跳",
         "飞机", "羊驼", "小样儿", "跳绳", "右太极", "拜托", "回头", "河蟹",
         "挥手", "啊", "祈祷", "左太极", "献吻", "女人", "肥皂", "点赞", "招财猫",
         "托脸", "灯笼",  "吃", "红包", "鞭炮", "劲爆", "花痴", "菊花",
         "脸红", "喝奶", "送花", "K歌", "蛋",
         "街舞", "棒棒糖", "大笑", "喝彩"]


def getface(des):
    if des in faces:
        return '/%s' % des
    else:
        return None


def getfacebyran(avals):
    return '/%s' % random.choice(avals)
